benchmark/benchmark-result-2025-12-26/sleep_0ms/keep-alive/hunchentoot_default.log
hunchentoot_default.log
HUNCHENTOOT	1.3.1

LISP-IMPLEMENTATION-TYPE   	SBCL                               
LISP-IMPLEMENTATION-VERSION	2.2.9.debian                       
MACHINE-TYPE               	X86-64                             
MACHINE-VERSION            	13th Gen Intel(R) Core(TM) i7-1360P
SOFTWARE-TYPE              	Linux                              
SOFTWARE-VERSION           	5.15.153.1-microsoft-standard-WSL2 
*handler-sleep-seconds*	0.0

# -t 4 -c 100 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.10ms   95.91ms 821.14ms   95.47%
    Req/Sec     9.42k     9.50k   48.68k    89.70%
  351253 requests in 10.09s, 49.24MB read
Requests/sec:  34799.85
Transfer/sec:      4.88MB

# -t 4 -c 10 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   725.85us  435.43us  18.00ms   97.08%
    Req/Sec     2.77k   248.17     3.71k    72.95%
  111182 requests in 10.10s, 15.59MB read
Requests/sec:  11008.14
Transfer/sec:      1.54MB

# -t 16 -c 400 -d 10 http://localhost:4242/yo 
Running 10s test @ http://localhost:4242/yo
  16 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.46ms  109.20ms   1.83s    95.81%
    Req/Sec     2.40k     3.77k   19.06k    79.97%
  307469 requests in 10.10s, 43.88MB read
  Socket errors: connect 0, read 2483, write 2005, timeout 31
  Non-2xx or 3xx responses: 4488
Requests/sec:  30441.98
Transfer/sec:      4.34MB